[Killed] ConditionalExpression
src/lib/transducers/transformers.ts:161:42
 
 export function fromRange(to: number, step: number) {
   if (step === 0) throw new Error("step cannot be 0");
-  const cond = step > 0 ? (v: number) => v <= to : (v: number) => v >= to;
+  const cond = step > 0 ? (v: number) => false : (v: number) => v >= to;
   return fromLoop(cond, (v) => v + step);
 }
killedBy: reducers rangeForm should produce the elements up to value by increment
statusReason: Property failed after 1 tests
{ seed: 1203788763, path: "0:0:1", endOnFailure: true }
Counterexample: [[0,1,0]]
Shrunk 2 time(s)
Got AssertionError: expected 0 to be greater than 0

[Killed] EqualityOperator
src/lib/transducers/transformers.ts:161:67
 
 export function fromRange(to: number, step: number) {
   if (step === 0) throw new Error("step cannot be 0");
-  const cond = step > 0 ? (v: number) => v <= to : (v: number) => v >= to;
+  const cond = step > 0 ? (v: number) => v <= to : (v: number) => v > to;
   return fromLoop(cond, (v) => v + step);
 }
killedBy: reducers rangeForm should produce the elements up to value by increment
statusReason: Property failed after 2 tests
{ seed: -1018256749, path: "1:2:0:1", endOnFailure: true }
Counterexample: [[0,-1,0]]
Shrunk 3 time(s)
Got AssertionError: expected 0 to be less than 0
