[Killed] ConditionalExpression
src/lib/transducers/core.ts:57:11
     try {
       acc = fold_(acc, b);
     } catch (value) {
-      if (value !== cutSymbol) throw value;
+      if (true) throw value;
       close();
     }
killedBy: reducers take should take
statusReason: Property failed after 4 tests
{ seed: -1154850, path: "3:1:0:0:1", endOnFailure: true }
Counterexample: [0,[0]]
Shrunk 4 time(s)
Got Symbol(cut)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Timeout] BlockStatement
src/lib/transducers/core.ts:89:19
   let unacc = coll.setup(init);
   const unfold = coll.unfold;
   return function next(): IteratorResult<B> {
-    while (alive) {
-      if (acc.length > 0) {
-        const res = acc.shift()!;
-        return { done: false, value: res };
-      }
-      const r = unfold(unacc);
-      if (r === undefined) {
-        close();
-        return { done: true, value: undefined };
-      }
-      let b;
-      [unacc, b] = r;
-      try {
-        acc = fold_(acc, b);
-      } catch (value) {
-        if (value !== cutSymbol) throw value;
-        close();
-        return { done: true, value: undefined };
-      }
-    }
+    while (alive) {}
     if (acc.length > 0) {
       const res = acc.shift()!;

[Killed] BlockStatement
src/lib/transducers/core.ts:90:27
   const unfold = coll.unfold;
   return function next(): IteratorResult<B> {
     while (alive) {
-      if (acc.length > 0) {
-        const res = acc.shift()!;
-        return { done: false, value: res };
-      }
+      if (acc.length > 0) {}
       const r = unfold(unacc);
       if (r === undefined) {
killedBy: utils transformIterator should iterate
statusReason: Property failed after 1 tests
{ seed: -1634070759, path: "0:1:0:1", endOnFailure: true }
Counterexample: [[0]]
Shrunk 3 time(s)
Got AssertionError: expected [] to deeply equal [ +0 ]

[Killed] BooleanLiteral
src/lib/transducers/core.ts:92:24
     while (alive) {
       if (acc.length > 0) {
         const res = acc.shift()!;
-        return { done: false, value: res };
+        return { done: true, value: res };
       }
       const r = unfold(unacc);
killedBy: utils transformIterator should iterate
statusReason: Property failed after 1 tests
{ seed: 1719055934, path: "0:1:0:0:1", endOnFailure: true }
Counterexample: [[0]]
Shrunk 4 time(s)
Got AssertionError: expected [] to deeply equal [ +0 ]

[Killed] ConditionalExpression
src/lib/transducers/core.ts:109:9
         return { done: true, value: undefined };
       }
     }
-    if (acc.length > 0) {
+    if (false) {
       const res = acc.shift()!;
       return { done: false, value: res };
killedBy: utils transformIterator should iterate, and stop(close)
statusReason: Property failed after 1 tests
{ seed: -1418055779, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: [{"n":1,"data":[0,0]}]
Shrunk 4 time(s)
Got AssertionError: expected [] to deeply equal [ +0 ]
