[Killed] ArrayDeclaration
src/lib/transducers/transformers.ts:91:25
 
 export function arrayColl<T>(): ICollection<T[], T[], T> {
   const coll = {
-    setup: (xs: T[]) => [...xs],
+    setup: (xs: T[]) => [],
     unfold: function (xs: T[]) {
       const x = xs.shift();
killedBy: reducers fromArray should respect the identity law
statusReason: Property failed after 2 tests
{ seed: -1216445639, path: "1:1:0:0:0:1", endOnFailure: true }
Counterexample: [[0]]
Shrunk 5 time(s)
Got AssertionError: expected [] to deeply equal [ +0 ]
