[Killed] EqualityOperator
src/lib/transducers/reducers.ts:19:9
 
 export function take<A, B>(n: number): Op<A, B, B> {
   return function (ctx) {
-    if (n === 0)
+    if (n !== 0)
       return {
         ...ctx,
killedBy: utils transformIterator should iterate, and stop(close)
statusReason: Property failed after 1 tests
{ seed: 1893926196, path: "0:0:0:0", endOnFailure: true }
Counterexample: [{"n":1,"data":[0,0]}]
Shrunk 3 time(s)
Got AssertionError: expected [] to deeply equal [ +0 ]

[Killed] ConditionalExpression
src/lib/transducers/reducers.ts:19:9
 
 export function take<A, B>(n: number): Op<A, B, B> {
   return function (ctx) {
-    if (n === 0)
+    if (true)
       return {
         ...ctx,
killedBy: utils transformIterator should iterate, and stop(close)
statusReason: Property failed after 1 tests
{ seed: 1095754225, path: "0:0:0:0", endOnFailure: true }
Counterexample: [{"n":1,"data":[0,0]}]
Shrunk 3 time(s)
Got AssertionError: expected [] to deeply equal [ +0 ]

[Killed] ConditionalExpression
src/lib/transducers/reducers.ts:32:13
       ...ctx,
       fold: function (a, b) {
         i++;
-        if (i === n) ctx.close();
+        if (true) ctx.close();
         return ctx.fold(a, b);
       },
killedBy: reducers take should take
statusReason: Property failed after 1 tests
{ seed: 1196968105, path: "0:1:3:3", endOnFailure: true }
Counterexample: [2,[0,0]]
Shrunk 3 time(s)
Got AssertionError: expected [ +0 ] to have a length of 2 but got 1

[Killed] EqualityOperator
src/lib/transducers/reducers.ts:32:13
       ...ctx,
       fold: function (a, b) {
         i++;
-        if (i === n) ctx.close();
+        if (i !== n) ctx.close();
         return ctx.fold(a, b);
       },
killedBy: reducers take should take
statusReason: Property failed after 1 tests
{ seed: 1274500561, path: "0:1:2:1:2:3", endOnFailure: true }
Counterexample: [1,[0,0]]
Shrunk 5 time(s)
Got AssertionError: expected [ +0, +0 ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/lib/transducers/reducers.ts:46:13
       ...ctx,
       fold: function (a, b) {
         i++;
-        if (i > n) return ctx.fold(a, b);
+        if (false) return ctx.fold(a, b);
         return a;
       },
killedBy: reducers drop should drop
statusReason: Property failed after 1 tests
{ seed: 263401482, path: "0:0:1:0:0:1", endOnFailure: true }
Counterexample: [0,[0]]
Shrunk 5 time(s)
Got AssertionError: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/lib/transducers/reducers.ts:83:13
     return {
       ...ctx,
       fold: function (a, b) {
-        if (c(b)) {
+        if (false) {
           ctx.close();
           return ctx.fold(a, b);
killedBy: reducers find should takeWhile pred is true
statusReason: Property failed after 1 tests
{ seed: 1293092108, path: "0:1:2:1:1", endOnFailure: true }
Counterexample: [3,[3]]
Shrunk 4 time(s)
Got AssertionError: expected [] to deeply equal [ 3 ]

[Killed] BlockStatement
src/lib/transducers/reducers.ts:83:19
     return {
       ...ctx,
       fold: function (a, b) {
-        if (c(b)) {
-          ctx.close();
-          return ctx.fold(a, b);
-        }
+        if (c(b)) {}
         return a;
       },
killedBy: reducers find should takeWhile pred is true
statusReason: Property failed after 3 tests
{ seed: -1580486472, path: "2:1", endOnFailure: true }
Counterexample: [0,[0]]
Shrunk 1 time(s)
Got AssertionError: expected [] to deeply equal [ +0 ]

[Killed] ConditionalExpression
src/lib/transducers/reducers.ts:124:31
     return {
       ...ctx,
       fold: function (acc, b) {
-        const pass = first || last !== b;
+        const pass = first || false;
         first = false;
         last = b;
killedBy: reducers uniq should remove consecutive duplicates (including undefined)
statusReason: Property failed after 1 tests
{ seed: 139001010, path: "0:0:1:2", endOnFailure: true }
Counterexample: [{"num":false,"times":[1,1]}]
Shrunk 3 time(s)
Got AssertionError: expected [ 1 ] to deeply equal [ 1, undefined ]

[Killed] EqualityOperator
src/lib/transducers/reducers.ts:124:31
     return {
       ...ctx,
       fold: function (acc, b) {
-        const pass = first || last !== b;
+        const pass = first || last === b;
         first = false;
         last = b;
killedBy: reducers uniq should remove consecutive duplicates (including undefined)
statusReason: Property failed after 1 tests
{ seed: -1702642066, path: "0:2:3", endOnFailure: true }
Counterexample: [{"num":false,"times":[1,1]}]
Shrunk 2 time(s)
Got AssertionError: expected [ 1 ] to deeply equal [ 1, undefined ]

[Killed] ConditionalExpression
src/lib/transducers/reducers.ts:159:7
 }
 
 export function slices<A, B>(len: number): Op<A, B[], B> {
-  if (len <= 0) throw new Error("len must be positive");
+  if (false) throw new Error("len must be positive");
   return function (ctx) {
     let acc_: B[] = [];
killedBy: reducers slices should return consecutive slices of length n, leaving out extra values
statusReason: Property failed after 17 tests
{ seed: -1809365308, path: "16", endOnFailure: true }
Counterexample: [{"n":0,"xs":[]}]
Shrunk 0 time(s)
Got AssertionError: expected [Function] to throw an error

[Killed] EqualityOperator
src/lib/transducers/reducers.ts:159:7
 }
 
 export function slices<A, B>(len: number): Op<A, B[], B> {
-  if (len <= 0) throw new Error("len must be positive");
+  if (len < 0) throw new Error("len must be positive");
   return function (ctx) {
     let acc_: B[] = [];
killedBy: reducers slices should return consecutive slices of length n, leaving out extra values
statusReason: Property failed after 12 tests
{ seed: -1615044513, path: "11", endOnFailure: true }
Counterexample: [{"n":0,"xs":[]}]
Shrunk 0 time(s)
Got AssertionError: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/transducers/reducers.ts:166:13
       ...ctx,
       fold: function (acc, b) {
         acc_.push(b);
-        if (acc_.length === len) {
+        if (true) {
           const res = acc_;
           acc_ = [];
killedBy: reducers slices should return consecutive slices of length n, leaving out extra values
statusReason: Property failed after 6 tests
{ seed: 706961774, path: "5:1:0:2:1:2:3", endOnFailure: true }
Counterexample: [{"n":2,"xs":[0,0]}]
Shrunk 6 time(s)
Got AssertionError: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/transducers/reducers.ts:178:7
 }
 
 export function apertures<A, B>(len: number): Op<A, B[], B> {
-  if (len <= 0) throw new Error("len must be positive");
+  if (false) throw new Error("len must be positive");
   return function (ctx) {
     let acc_: B[] = [];
killedBy: reducers apertures should return sliding windows of length n
statusReason: Property failed after 7 tests
{ seed: -1763749345, path: "6", endOnFailure: true }
Counterexample: [{"n":0,"xs":[]}]
Shrunk 0 time(s)
Got AssertionError: expected [Function] to throw an error

[Killed] EqualityOperator
src/lib/transducers/reducers.ts:178:7
 }
 
 export function apertures<A, B>(len: number): Op<A, B[], B> {
-  if (len <= 0) throw new Error("len must be positive");
+  if (len < 0) throw new Error("len must be positive");
   return function (ctx) {
     let acc_: B[] = [];
killedBy: reducers apertures should return sliding windows of length n
statusReason: Property failed after 5 tests
{ seed: 58586388, path: "4", endOnFailure: true }
Counterexample: [{"n":0,"xs":[]}]
Shrunk 0 time(s)
Got AssertionError: expected [Function] to throw an error
