[Killed] BooleanLiteral
src/lib/transducers/core.ts:35:15
   init: Q,
   coll: ICollection<P, Q, N>,
 ): A {
-  let alive = true;
+  let alive = false;
   function close() {
     alive = false;
killedBy: reducers errors shoud rethrow an error (core/transform)
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/transducers/core.ts:36:20
   coll: ICollection<P, Q, N>,
 ): A {
   let alive = true;
-  function close() {
-    alive = false;
-  }
+  function close() {}
   const ctx = op({
     cut,
killedBy: reducers takeWhile should take while cond is true
statusReason: expected [ 1, 3, 5 ] to deeply equal [ 1, 3 ]

[Killed] BooleanLiteral
src/lib/transducers/core.ts:37:13
 ): A {
   let alive = true;
   function close() {
-    alive = false;
+    alive = true;
   }
   const ctx = op({
killedBy: reducers takeWhile should take while cond is true
statusReason: expected [ 1, 3, 5 ] to deeply equal [ 1, 3 ]

[Timeout] BlockStatement
src/lib/transducers/core.ts:49:17
   const fold_ = ctx.fold;
   let unacc = coll.setup(init);
   const unfold = coll.unfold;
-  while (alive) {
-    const r = unfold(unacc);
-    if (r === undefined) break;
-    let b;
-    [unacc, b] = r;
-    try {
-      acc = fold_(acc, b);
-    } catch (value) {
-      if (value !== cutSymbol) throw value;
-      close();
-    }
-  }
+  while (alive) {}
   return acc;
 }

[Killed] BlockStatement
src/lib/transducers/core.ts:54:9
     if (r === undefined) break;
     let b;
     [unacc, b] = r;
-    try {
-      acc = fold_(acc, b);
-    } catch (value) {
+    try {} catch (value) {
       if (value !== cutSymbol) throw value;
       close();
killedBy: reducers errors shoud rethrow an error (core/transform)
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/transducers/core.ts:56:21
     [unacc, b] = r;
     try {
       acc = fold_(acc, b);
-    } catch (value) {
-      if (value !== cutSymbol) throw value;
-      close();
-    }
+    } catch (value) {}
   }
   return acc;
killedBy: reducers errors shoud rethrow an error (core/transform)
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/lib/transducers/core.ts:57:11
     try {
       acc = fold_(acc, b);
     } catch (value) {
-      if (value !== cutSymbol) throw value;
+      if (value === cutSymbol) throw value;
       close();
     }
killedBy: reducers errors shoud rethrow an error (core/transform)
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/transducers/core.ts:57:11
     try {
       acc = fold_(acc, b);
     } catch (value) {
-      if (value !== cutSymbol) throw value;
+      if (false) throw value;
       close();
     }
killedBy: reducers errors shoud rethrow an error (core/transform)
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/lib/transducers/core.ts:69:15
   init: Q,
   coll: ICollection<P, Q, N>,
 ) {
-  let alive = true;
+  let alive = false;
   function close() {
     alive = false;
killedBy: utils transformIterator should iterate
statusReason: expected [] to deeply equal [ 2, 4, 6 ]

[Timeout] BlockStatement
src/lib/transducers/core.ts:89:19
   let unacc = coll.setup(init);
   const unfold = coll.unfold;
   return function next(): IteratorResult<B> {
-    while (alive) {
-      if (acc.length > 0) {
-        const res = acc.shift() as B;
-        return { done: false, value: res };
-      }
-      const r = unfold(unacc);
-      if (r === undefined) {
-        close();
-        return { done: true, value: undefined };
-      }
-      let b;
-      [unacc, b] = r;
-      try {
-        acc = fold_(acc, b);
-      } catch (value) {
-        if (value !== cutSymbol) throw value;
-        close();
-        return { done: true, value: undefined };
-      }
-    }
+    while (alive) {}
     if (acc.length > 0) {
       const res = acc.shift() as B;

[Killed] ConditionalExpression
src/lib/transducers/core.ts:90:11
   const unfold = coll.unfold;
   return function next(): IteratorResult<B> {
     while (alive) {
-      if (acc.length > 0) {
+      if (false) {
         const res = acc.shift() as B;
         return { done: false, value: res };
killedBy: utils transformIterator should iterate
statusReason: expected [] to deeply equal [ 2, 4, 6 ]

[Killed] BlockStatement
src/lib/transducers/core.ts:90:27
   const unfold = coll.unfold;
   return function next(): IteratorResult<B> {
     while (alive) {
-      if (acc.length > 0) {
-        const res = acc.shift() as B;
-        return { done: false, value: res };
-      }
+      if (acc.length > 0) {}
       const r = unfold(unacc);
       if (r === undefined) {
killedBy: utils transformIterator should iterate
statusReason: expected [] to deeply equal [ 2, 4, 6 ]

[Killed] BooleanLiteral
src/lib/transducers/core.ts:92:24
     while (alive) {
       if (acc.length > 0) {
         const res = acc.shift() as B;
-        return { done: false, value: res };
+        return { done: true, value: res };
       }
       const r = unfold(unacc);
killedBy: utils transformIterator should iterate
statusReason: expected [] to deeply equal [ 2, 4, 6 ]

[Killed] BlockStatement
src/lib/transducers/core.ts:103:23
       [unacc, b] = r;
       try {
         acc = fold_(acc, b);
-      } catch (value) {
-        if (value !== cutSymbol) throw value;
-        close();
-        return { done: true, value: undefined };
-      }
+      } catch (value) {}
     }
     if (acc.length > 0) {
killedBy: reducers errors shoud rethrow an error (core/step)
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/lib/transducers/core.ts:109:9
         return { done: true, value: undefined };
       }
     }
-    if (acc.length > 0) {
+    if (acc.length <= 0) {
       const res = acc.shift() as B;
       return { done: false, value: res };
killedBy: reducers zip should zip and take
statusReason: expected [] to deeply equal [ [ 1, 4 ] ]

[Killed] EqualityOperator
src/lib/transducers/core.ts:109:9
         return { done: true, value: undefined };
       }
     }
-    if (acc.length > 0) {
+    if (acc.length >= 0) {
       const res = acc.shift() as B;
       return { done: false, value: res };
killedBy: reducers zip should zip and take
statusReason: expected [ [ 1, 4 ], [ 2, undefined ], …(1) ] to deeply equal [ [ 1, 4 ] ]
