[Killed] UpdateOperator
src/lib/transducers/reducers.ts:23:9
     return {
       ...ctx,
       fold: function (a, b) {
-        i++;
+        i--;
         // Stryker disable next-line ConditionalExpression
         if (i === n) ctx.close();
killedBy: reducers zip should zip and take
statusReason: expected [ [ 1, 4 ], [ 2, 5 ], [ 3, 6 ] ] to deeply equal [ [ 1, 4 ] ]

[Killed] EqualityOperator
src/lib/transducers/reducers.ts:25:13
       fold: function (a, b) {
         i++;
         // Stryker disable next-line ConditionalExpression
-        if (i === n) ctx.close();
+        if (i !== n) ctx.close();
         return ctx.fold(a, b);
       },
killedBy: reducers take should take a kayak (and a chair)
statusReason: expected [ 'kayak' ] to deeply equal [ 'kayak', 'chair' ]

[Killed] ConditionalExpression
src/lib/transducers/reducers.ts:39:13
       ...ctx,
       fold: function (a, b) {
         i++;
-        if (i > n) return ctx.fold(a, b);
+        if (true) return ctx.fold(a, b);
         return a;
       },
killedBy: reducers drop should drop a kayak
statusReason: expected [ 'kayak', 'chair', 'goat' ] to deeply equal [ 'chair', 'goat' ]

[Killed] EqualityOperator
src/lib/transducers/reducers.ts:39:13
       ...ctx,
       fold: function (a, b) {
         i++;
-        if (i > n) return ctx.fold(a, b);
+        if (i <= n) return ctx.fold(a, b);
         return a;
       },
killedBy: reducers drop should drop a kayak
statusReason: expected [ 'kayak' ] to deeply equal [ 'chair', 'goat' ]

[Killed] ConditionalExpression
src/lib/transducers/reducers.ts:51:13
     return {
       ...ctx,
       fold: function (a, b) {
-        if (c(b)) return ctx.fold(a, b);
+        if (false) return ctx.fold(a, b);
         return ctx.cut(); // return is needed to have correct typing
       },
killedBy: reducers errors shoud rethrow an error (core/step)
statusReason: expected [] to deeply equal [ [ 1, 4 ] ]

[Killed] ConditionalExpression
src/lib/transducers/reducers.ts:51:13
     return {
       ...ctx,
       fold: function (a, b) {
-        if (c(b)) return ctx.fold(a, b);
+        if (true) return ctx.fold(a, b);
         return ctx.cut(); // return is needed to have correct typing
       },
killedBy: reducers errors shoud rethrow an error (core/step)
statusReason: expected [ [ 1, 4 ], [ 2, 5 ], [ 3, 6 ] ] to deeply equal [ [ 1, 4 ] ]

[Killed] BooleanLiteral
src/lib/transducers/reducers.ts:60:20
 
 export function dropWhile<A, B>(c: (b: B) => boolean): Op<A, B, B> {
   return function (ctx) {
-    let dropping = true;
+    let dropping = false;
     return {
       ...ctx,
killedBy: reducers dropWhile should drop while cond is true
statusReason: expected [ 1, 3, 4, 5 ] to deeply equal [ 4, 5 ]

[Killed] AssignmentOperator
src/lib/transducers/reducers.ts:64:9
     return {
       ...ctx,
       fold: function (a, b) {
-        dropping &&= c(b);
+        dropping ||= c(b);
         if (dropping) return a;
         return ctx.fold(a, b);
killedBy: reducers dropWhile should drop while cond is true
statusReason: expected [] to deeply equal [ 4, 5 ]

[Killed] ConditionalExpression
src/lib/transducers/reducers.ts:65:13
       ...ctx,
       fold: function (a, b) {
         dropping &&= c(b);
-        if (dropping) return a;
+        if (true) return a;
         return ctx.fold(a, b);
       },
killedBy: reducers dropWhile should drop while cond is true
statusReason: expected [] to deeply equal [ 4, 5 ]

[Killed] ConditionalExpression
src/lib/transducers/reducers.ts:65:13
       ...ctx,
       fold: function (a, b) {
         dropping &&= c(b);
-        if (dropping) return a;
+        if (false) return a;
         return ctx.fold(a, b);
       },
killedBy: reducers dropWhile should drop while cond is true
statusReason: expected [ 1, 3, 4, 5 ] to deeply equal [ 4, 5 ]

[Killed] BooleanLiteral
src/lib/transducers/reducers.ts:77:13
     return {
       ...ctx,
       fold: function (a, b) {
-        if (!c(b)) return ctx.fold(a, b);
+        if (c(b)) return ctx.fold(a, b);
         ctx.close();
         return ctx.fold(a, b);
killedBy: reducers find should return all results up to seek target
statusReason: expected [ 'kayak' ] to deeply equal [ 'kayak', 'chair' ]

[Killed] ConditionalExpression
src/lib/transducers/reducers.ts:77:13
     return {
       ...ctx,
       fold: function (a, b) {
-        if (!c(b)) return ctx.fold(a, b);
+        if (true) return ctx.fold(a, b);
         ctx.close();
         return ctx.fold(a, b);
killedBy: reducers find should return all results up to seek target
statusReason: expected [ 'kayak', 'chair', 'goat' ] to deeply equal [ 'kayak', 'chair' ]

[Killed] BooleanLiteral
src/lib/transducers/reducers.ts:111:17
 
 export function uniq<A, B>(): Op<A, B, B> {
   return function (ctx) {
-    let first = true;
+    let first = false;
     let last: B | undefined = undefined;
     return {
killedBy: reducers uniq should treat undefined as any other value
statusReason: expected [ 1, undefined, 3, 1, 3 ] to deeply equal [ undefined, 1, undefined, 3, 1, 3 ]

[Killed] ConditionalExpression
src/lib/transducers/reducers.ts:116:22
     return {
       ...ctx,
       fold: function (acc, b) {
-        const pass = first || last !== b;
+        const pass = false;
         first = false;
         last = b;
killedBy: reducers uniq should remove consecutive duplicates
statusReason: expected [] to deeply equal [ 1, 2, 3, 2 ]

[Killed] ConditionalExpression
src/lib/transducers/reducers.ts:116:22
     return {
       ...ctx,
       fold: function (acc, b) {
-        const pass = first || last !== b;
+        const pass = true;
         first = false;
         last = b;
killedBy: reducers uniq should remove consecutive duplicates
statusReason: expected [ 1, 1, 2, 3, 2 ] to deeply equal [ 1, 2, 3, 2 ]

[Killed] BooleanLiteral
src/lib/transducers/reducers.ts:117:17
       ...ctx,
       fold: function (acc, b) {
         const pass = first || last !== b;
-        first = false;
+        first = true;
         last = b;
         if (pass) return ctx.fold(acc, b);
killedBy: reducers uniq should remove consecutive duplicates
statusReason: expected [ 1, 1, 2, 3, 2 ] to deeply equal [ 1, 2, 3, 2 ]

[Killed] ConditionalExpression
src/lib/transducers/reducers.ts:119:13
         const pass = first || last !== b;
         first = false;
         last = b;
-        if (pass) return ctx.fold(acc, b);
+        if (true) return ctx.fold(acc, b);
         return acc;
       },
killedBy: reducers uniq should remove consecutive duplicates
statusReason: expected [ 1, 1, 2, 3, 2 ] to deeply equal [ 1, 2, 3, 2 ]

[Killed] ConditionalExpression
src/lib/transducers/reducers.ts:119:13
         const pass = first || last !== b;
         first = false;
         last = b;
-        if (pass) return ctx.fold(acc, b);
+        if (false) return ctx.fold(acc, b);
         return acc;
       },
killedBy: reducers uniq should remove consecutive duplicates
statusReason: expected [] to deeply equal [ 1, 2, 3, 2 ]

[Killed] BlockStatement
src/lib/transducers/reducers.ts:157:34
       ...ctx,
       fold: function (acc, b) {
         acc_.push(b);
-        if (acc_.length === len) {
-          const res = acc_;
-          acc_ = [];
-          return ctx.fold(acc, res);
-        }
+        if (acc_.length === len) {}
         return acc;
       },
killedBy: reducers slices should return consecutive slices of length n, leaving out extra values
statusReason: expected [] to deeply equal [ [ 1, 2 ], [ 3, 4 ] ]

[Killed] EqualityOperator
src/lib/transducers/reducers.ts:157:13
       ...ctx,
       fold: function (acc, b) {
         acc_.push(b);
-        if (acc_.length === len) {
+        if (acc_.length !== len) {
           const res = acc_;
           acc_ = [];
killedBy: reducers slices should return consecutive slices of length n, leaving out extra values
statusReason: expected [ [ 1 ], [ 2 ], [ 3 ], [ 4 ], [ 5 ] ] to deeply equal [ [ 1, 2 ], [ 3, 4 ] ]

[Killed] BlockStatement
src/lib/transducers/reducers.ts:175:34
       ...ctx,
       fold: function (acc, b) {
         acc_.push(b);
-        if (acc_.length === len) {
-          const res = acc_;
-          acc_ = acc_.slice(1);
-          return ctx.fold(acc, res);
-        }
+        if (acc_.length === len) {}
         return acc;
       },
killedBy: reducers apertures should return sliding windows of length n
statusReason: expected [] to deeply equal [ [ 1, 2 ], [ 2, 3 ] ]

[Killed] ConditionalExpression
src/lib/transducers/reducers.ts:175:13
       ...ctx,
       fold: function (acc, b) {
         acc_.push(b);
-        if (acc_.length === len) {
+        if (false) {
           const res = acc_;
           acc_ = acc_.slice(1);
killedBy: reducers apertures should return sliding windows of length n
statusReason: expected [] to deeply equal [ [ 1, 2 ], [ 2, 3 ] ]

[Killed] MethodExpression
src/lib/transducers/reducers.ts:177:18
         acc_.push(b);
         if (acc_.length === len) {
           const res = acc_;
-          acc_ = acc_.slice(1);
+          acc_ = acc_;
           return ctx.fold(acc, res);
         }
killedBy: reducers apertures should return sliding windows of length n
statusReason: expected [ [ 1, 2, 3 ] ] to deeply equal [ [ 1, 2 ], [ 2, 3 ] ]

[Killed] ConditionalExpression
src/lib/transducers/reducers.ts:226:13
       ...ctx,
       fold: function (acc, b) {
         const r = iter();
-        if (r.done) {
+        if (true) {
           return ctx.cut();
         }
killedBy: reducers errors shoud rethrow an error (core/step)
statusReason: expected [] to deeply equal [ [ 1, 4 ] ]

[Killed] BlockStatement
src/lib/transducers/reducers.ts:226:21
       ...ctx,
       fold: function (acc, b) {
         const r = iter();
-        if (r.done) {
-          return ctx.cut();
-        }
+        if (r.done) {}
         const c = r.value;
         return ctx.fold(acc, [b, c] as const);
killedBy: reducers errors shoud rethrow an error (core/step)
statusReason: expected [ [ 1, 4 ], [ 2, undefined ], …(1) ] to deeply equal [ [ 1, 4 ] ]
