[Killed] ArrowFunction
src/lib/transducers/transformers.ts:27:11
 export function toLast<T>() {
   return {
     init: constant(undefined),
-    fold: (_acc: T | undefined, b: T) => b,
+    fold: () => undefined,
     result: identity,
   };
killedBy: reducers last should return the last value
statusReason: expected undefined to deeply equal 3

[Killed] ConditionalExpression
src/lib/transducers/transformers.ts:53:11
     setup: getIter<T>,
     unfold: function (next: () => IteratorResult<T, any>) {
       const { value, done } = next();
-      if (done) return undefined;
+      if (true) return undefined;
       return [next, value] as const;
     },
killedBy: reducers errors shoud rethrow an error (core/transform)
statusReason: expected [Function] to throw an error

[Timeout] ConditionalExpression
src/lib/transducers/transformers.ts:53:11
     setup: getIter<T>,
     unfold: function (next: () => IteratorResult<T, any>) {
       const { value, done } = next();
-      if (done) return undefined;
+      if (false) return undefined;
       return [next, value] as const;
     },

[Killed] EqualityOperator
src/lib/transducers/transformers.ts:94:11
     setup: identity<T[]>,
     unfold: function (xs: T[]) {
       const x = xs.shift();
-      if (x === undefined) {
+      if (x !== undefined) {
         return undefined;
       }
killedBy: reducers map should map values with function
statusReason: expected [] to deeply equal [ 2, 4, 6 ]

[Killed] ConditionalExpression
src/lib/transducers/transformers.ts:94:11
     setup: identity<T[]>,
     unfold: function (xs: T[]) {
       const x = xs.shift();
-      if (x === undefined) {
+      if (true) {
         return undefined;
       }
killedBy: reducers map should map values with function
statusReason: expected [] to deeply equal [ 2, 4, 6 ]

[Killed] EqualityOperator
src/lib/transducers/transformers.ts:123:11
   return {
     setup: identity<T>,
     unfold: function (acc: T) {
-      if (acc === id) return undefined;
+      if (acc !== id) return undefined;
       return [id, acc] as const;
     },
killedBy: reducers sumForm should respect identity law
statusReason: expected +0 to deeply equal 3

[Killed] ConditionalExpression
src/lib/transducers/transformers.ts:123:11
   return {
     setup: identity<T>,
     unfold: function (acc: T) {
-      if (acc === id) return undefined;
+      if (true) return undefined;
       return [id, acc] as const;
     },
killedBy: reducers sumForm should respect identity law
statusReason: expected +0 to deeply equal 3

[Killed] ArithmeticOperator
src/lib/transducers/transformers.ts:135:63
   };
 }
 
-export const toSum = toOpFactory(0, (a: number, b: number) => a + b);
+export const toSum = toOpFactory(0, (a: number, b: number) => a - b);
 export const fromSum = fromOpFactory(0);
 export const toMul = toOpFactory(1, (a: number, b: number) => a * b);
killedBy: reducers sumForm should return the sum of elements
statusReason: expected -3 to deeply equal 3

[Killed] ArithmeticOperator
src/lib/transducers/transformers.ts:137:63
 
 export const toSum = toOpFactory(0, (a: number, b: number) => a + b);
 export const fromSum = fromOpFactory(0);
-export const toMul = toOpFactory(1, (a: number, b: number) => a * b);
+export const toMul = toOpFactory(1, (a: number, b: number) => a / b);
 export const fromMul = fromOpFactory(1);
 export const toConcat = toOpFactory("", (a: string, b: string) => a + b);
killedBy: reducers mulForm should respect identity law
statusReason: expected 0.3333333333333333 to deeply equal 3

[Killed] StringLiteral
src/lib/transducers/transformers.ts:140:41
 export const toMul = toOpFactory(1, (a: number, b: number) => a * b);
 export const fromMul = fromOpFactory(1);
 export const toConcat = toOpFactory("", (a: string, b: string) => a + b);
-export const fromConcat = fromOpFactory("");
+export const fromConcat = fromOpFactory("Stryker was here!");
 
 export function loopColl<T>(cond: (b: T) => boolean, step: (b: T) => T) {
killedBy: reducers concatForm should have zero element
statusReason: expected [ '' ] to deeply equal []

[Killed] ConditionalExpression
src/lib/transducers/transformers.ts:147:11
     setup: identity<T>,
     unfold: (acc: T) => {
       const b = acc;
-      if (!cond(b)) return undefined;
+      if (true) return undefined;
       acc = step(acc);
       return [acc, b] as const;
killedBy: reducers loopForm should loop from value applying step until condition is met
statusReason: expected [] to deeply equal [ +0, 1, 2 ]

[Killed] BooleanLiteral
src/lib/transducers/transformers.ts:147:11
     setup: identity<T>,
     unfold: (acc: T) => {
       const b = acc;
-      if (!cond(b)) return undefined;
+      if (cond(b)) return undefined;
       acc = step(acc);
       return [acc, b] as const;
killedBy: reducers loopForm should loop from value applying step until condition is met
statusReason: expected [] to deeply equal [ +0, 1, 2 ]

[Killed] ConditionalExpression
src/lib/transducers/transformers.ts:160:7
 }
 
 export function fromRange(to: number, step: number) {
-  if (step === 0) throw new Error("step cannot be 0");
+  if (true) throw new Error("step cannot be 0");
   // Stryker disable next-line EqualityOperator
   const cond = step > 0 ? (v: number) => v <= to : (v: number) => v >= to;
killedBy: reducers rangeForm should produce the elements up to value by increment ascending
statusReason: step cannot be 0

[Killed] ConditionalExpression
src/lib/transducers/transformers.ts:160:7
 }
 
 export function fromRange(to: number, step: number) {
-  if (step === 0) throw new Error("step cannot be 0");
+  if (false) throw new Error("step cannot be 0");
   // Stryker disable next-line EqualityOperator
   const cond = step > 0 ? (v: number) => v <= to : (v: number) => v >= to;
killedBy: reducers rangeForm should produce the elements up to value by increment should not have step 0
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/transducers/transformers.ts:162:42
 export function fromRange(to: number, step: number) {
   if (step === 0) throw new Error("step cannot be 0");
   // Stryker disable next-line EqualityOperator
-  const cond = step > 0 ? (v: number) => v <= to : (v: number) => v >= to;
+  const cond = step > 0 ? (v: number) => false : (v: number) => v >= to;
   return fromLoop(cond, (v) => v + step);
 }
killedBy: reducers rangeForm should produce the elements up to value by increment ascending
statusReason: expected [] to deeply equal [ +0, 2, 4 ]

[Killed] ConditionalExpression
src/lib/transducers/transformers.ts:162:16
 export function fromRange(to: number, step: number) {
   if (step === 0) throw new Error("step cannot be 0");
   // Stryker disable next-line EqualityOperator
-  const cond = step > 0 ? (v: number) => v <= to : (v: number) => v >= to;
+  const cond = true ? (v: number) => v <= to : (v: number) => v >= to;
   return fromLoop(cond, (v) => v + step);
 }
killedBy: reducers rangeForm should produce the elements up to value by increment descending
statusReason: expected [] to deeply equal [ +0, -2, -4 ]

[Timeout] ArithmeticOperator
src/lib/transducers/transformers.ts:163:32
   if (step === 0) throw new Error("step cannot be 0");
   // Stryker disable next-line EqualityOperator
   const cond = step > 0 ? (v: number) => v <= to : (v: number) => v >= to;
-  return fromLoop(cond, (v) => v + step);
+  return fromLoop(cond, (v) => v - step);
 }
 
